In [1]:
!pip install cx_oracle

Collecting cx_oracle
  Downloading cx_Oracle-8.3.0-cp38-cp38-win_amd64.whl (219 kB)
Installing collected packages: cx-oracle
Successfully installed cx-oracle-8.3.0

In [1]:
import cx_Oracle
dsn = cx_Oracle.makedsn('localhost',1521,'xe')
dsn

'(DESCRIPTION=(ADDRESS=(PROTOCOL=TCP)(HOST=localhost)(PORT=1521))(CONNECT_DATA=(SID=xe)))'

In [2]:
db = cx_Oracle.connect('C##CAKD5','CAKD5',dsn)
db

In [3]:
import pandas as pd
cursor = db.cursor()
cursor.execute('select * from book')
x = cursor.fetchall()
columns = ['BOOKID','BOOKNAME','PUBLISHER','PRICE']
df = pd.DataFrame(x,columns=columns)
df.head()

   BOOKID BOOKNAME PUBLISHER  PRICE
0       1   축구의 역사      굿스포츠   7000
1       2  축구아는 여자       나무수  13000
2       3   축구의 이해     대한미디어  22000
3       4   골프 바이블     대한미디어  35000
4       5    피겨 교본      굿스포츠   8000

In [5]:
# create
import cx_Oracle
con = cx_Oracle.connect('C##CAKD5/CAKD5@localhost:1521/xe')
cursor = con.cursor()
sql="create table sample1(id varchar2(10), score number)"
cursor.execute(sql)
cursor.close()
con.commit()
con.close()

In [6]:
# insert
def insert(t):
    con = cx_Oracle.connect('C##CAKD5/CAKD5@localhost:1521/xe')
    cursor = con.cursor()
    sql="insert into sample1 (id,score) values(:1,:2)"
    cursor.execute(sql,t)
    cursor.close()
    con.commit()
    con.close()
insert(('111',80))

In [8]:
# insert - executemany
rows = [('112',90),('113',70),('114',80),('115',90),('116',85)]
def insertmany(t):
    con = cx_Oracle.connect('C##CAKD5/CAKD5@localhost:1521/xe')
    cursor = con.cursor()
    sql="insert into sample1 (id,score) values(:1,:2)"
    cursor.executemany(sql,t)
    cursor.close()
    con.commit()
    con.close()

insertmany(rows)

In [ ]:
# Q. 3개의 속성(col01, col02, col03)으로 구성되는 테이블 sample2을 생성하고 10개의 데이터를 입력하세요.(사용자 함수 사용)
# 단, col01에 대하여 제약조건 primary key 설정(제약조건 이름 sample_pk)

In [9]:
import cx_Oracle
con = cx_Oracle.connect('C##CAKD5/CAKD5@localhost:1521/xe')
cursor = con.cursor()
sql="create table sample2(col01 varchar2(10), col02 varchar2(10), col03 varchar2(10),constraint sample_pk primary key (col01))"
cursor.execute(sql)
cursor.close()
con.commit()
con.close()

In [10]:
def insertcol(t):
    con = cx_Oracle.connect('C##CAKD5/CAKD5@localhost:1521/xe')
    cursor = con.cursor()
    sql="insert into sample2 (col01,col02,col03) values(:1,:2,:3)"
    cursor.executemany(sql,t)
    cursor.close()
    con.commit()
    con.close()

rows = [('1','1','1'),('2','1','1'),('3','1','1'),('4','1','1'),('5','1','1'),('6','1','1'),('7','1','1'),('8','1','1'),('9','1','1'),('10','1','1')]
insertcol(rows)

In [12]:
# update
def updatecol(t):
    con = cx_Oracle.connect('C##CAKD5/CAKD5@localhost:1521/xe')
    cursor = con.cursor()
    sql="update sample2 set col03=:1 where col01=:2 "
    cursor.execute(sql,t)
    cursor.close()
    con.commit()
    con.close()
updatecol(('3','1'))

In [16]:
# delete
def deletecol(t):
    con = cx_Oracle.connect('C##CAKD5/CAKD5@localhost:1521/xe')
    cursor = con.cursor()
    sql="delete from sample2 where col01=:1"
    cursor.execute(sql,t)
    cursor.close()
    con.commit()
    con.close()
deletecol(('10',))

In [23]:
import pandas as pd
con = cx_Oracle.connect('C##CAKD5/CAKD5@localhost:1521/xe')
cursor = con.cursor()
cursor.execute("select * from sample2")
x = cursor.fetchall()
df_col = pd.DataFrame(x)
cursor.execute("select column_name from user_tab_columns where table_name='SAMPLE2'")
col = cursor.fetchall()
list_py = []
for i in col:
    for j in i:
        list_py.append(j)
df_col.columns = list_py
df_col.head()

  COL01 COL02 COL03
0     1     1     3
1     2     1     1
2     3     1     1
3     4     1     1
4     5     1     1

In [25]:
df_col.to_csv('./data/col3.csv')

In [34]:
import csv
with open('./data/col3.csv','r') as csv_file:
    csv_reader = csv.reader(csv_file)
    next(csv_reader)
    data = []
    for line in csv_reader:
        data.append((line[1],line[2],line[3]))
data

[('1', '1', '3'),
 ('2', '1', '1'),
 ('3', '1', '1'),
 ('4', '1', '1'),
 ('5', '1', '1'),
 ('6', '1', '1'),
 ('7', '1', '1'),
 ('8', '1', '1'),
 ('9', '1', '1')]

In [35]:
con = cx_Oracle.connect('C##CAKD5/CAKD5@localhost:1521/xe')
cursor = con.cursor()
sql="alter table sample2 drop constraint sample_pk"
cursor.execute(sql)
cursor.close()
con.commit()
con.close()

In [37]:
with open('./data/col3.csv','r') as csv_file:
    csv_reader = csv.reader(csv_file)
    next(csv_reader)
    con = cx_Oracle.connect('C##CAKD5/CAKD5@localhost:1521/xe')
    cursor = con.cursor()
    sql = "insert into sample2 (col01,col02,col03) values(:1,:2,:3)"
    data = []
    for line in csv_reader:
        data.append((line[1],line[2],line[3]))
    cursor.executemany(sql,data)
    cursor.close()
    con.commit()
    con.close()

In [38]:
import cx_Oracle
con = cx_Oracle.connect('C##CAKD5/CAKD5@localhost:1521/xe')
cursor = con.cursor()
sql="create table sample3(id varchar2(10), sales number)"
cursor.execute(sql)
cursor.close()
con.commit()
con.close()

In [39]:
# 대량 데이터 입력
import numpy as np
import pandas as pd

df = pd.DataFrame()
df['id'] = np.arange(10000)
df['sales'] = np.random.randint(1,100,size=10000)
df.head()

   id  sales
0   0     47
1   1     70
2   2     94
3   3     95
4   4     34

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      10000 non-null  int32
 1   sales   10000 non-null  int32
dtypes: int32(2)
memory usage: 78.2 KB

In [41]:
df['id'] = df.id.astype('str')

In [42]:
ar = df.values
results = list([tuple(e) for e in ar])
results[:10]

[('0', 47),
 ('1', 70),
 ('2', 94),
 ('3', 95),
 ('4', 34),
 ('5', 26),
 ('6', 75),
 ('7', 99),
 ('8', 64),
 ('9', 95)]

In [45]:
con = cx_Oracle.connect('C##CAKD5/CAKD5@localhost:1521/xe')
cursor = con.cursor()
sql="insert into sample3 (id,sales) values(:1,:2)"

cursor.executemany(sql,results)
cursor.close()
con.commit()
con.close()

In [ ]:
# Q. ID의 자료 타입을 NUMBER로 변경하여 ID 기준으로 올림차순 정렬하여 출력하세요.

In [48]:
con = cx_Oracle.connect('C##CAKD5/CAKD5@localhost:1521/xe')
cursor = con.cursor()
sql="alter table sample3 modify id number"
# sql = 'truncate table sample3'
cursor.execute(sql)
cursor.close()
con.commit()
con.close()

In [49]:
con = cx_Oracle.connect('C##CAKD5/CAKD5@localhost:1521/xe')
cursor = con.cursor()
sql="insert into sample3 (id,sales) values(:1,:2)"

cursor.executemany(sql,results)
cursor.close()
con.commit()
con.close()

[과제] employees 테이블을 불러와서 다음사항을 수행하세요.
- 컬럼명을 포함하여 employees 테이블을 데이터프레임으로 출력
- department_id별 평균 연봉을 출력
- 부서별 평균 연봉을 수평 그래프로 시각화

[과제] PURPROD 테이블을 불러와서 다음사항을 수행하세요.
- 데이터프레임으로 출력
- 고객별 2014년 2015년 총구매액 및 평균구매액 출력
- 고객별 2014 VS 2015 총구매액 기준 성장율